{
  "sections": [
    {
      "id": "how-to",
      "title": "How to perform self-Ruqyah",
      "content": "First important thing to know, may Allah have mercy upon you, is the best person to perform Ruqyah on you is yourself. You are more aware of your situation and more truthful to yourself as you know the pain you’re going through more than anyone else. As this was the practice of the prophet and his companions. Ruqyah is one of the best remedies that the believers should use regularly."
    },
    {
      "id": "what-to-read",
      "title": "What should we read?",
      "content": "From the best of what you can read on yourself and family is Surah Al-Fatihah and the Muawithat (Surah Nas, Falaq and Ikhkas). A companion recited Surah Al Fatihah on another companion and the prophet Sallahu alaykum wa salam asked him, ‘How did you know it was Ruqyah?’ (Bukhari 2276) <br/> Aisha said, ‘When the messenger was ill he would recite the Muawithat on himself and spit drily. When his pain grew intense, I recited over him and wiped him with his own hand. (Bukhari 4728)<br/><br/>You can also recite other parts of the Quran. Try your best to recite if not listen to Surah Al Baqarah and complete it every 3 days for the shayateen hate this Surah and this Surah brings a lot of Barakah in the house."
    },
    {
      "id": "duas",
      "title": "Duas from the Sunnah",
      "content": "A man complained of pain in his hand, the prophet advised him to put his hand where the pain is and recite Bismillah 3 times and say 7 times ‘Authu bi-izzatillahi wa qudratihi min sharri ma ajidu wa uhadhir (I seek refuge with Allah in the glory and power of Allah from the evil of what I feel and worry about. (Tirmidhi 1696 authenticated by Albani)<br/><br/>The prophet used to seek refuge for Al Hasan and Al Hussain, he used to say, your father (Ibrahim) used to seek refuge with Allah for Ismail and Ishaq with these words ‘Authu bilal imari Allah Al-tammati min kulli shaytanin wa hammah wa min kulli aynin lammah (I seek redefine in the perfect words of Allah, from every devil and every poisonous reptile and from every evil eye) Bukhari 3191<br/><br/>Do your morning and evening Adhakar (book attached) after Fajr and Asr."
    },
    {
      "id": "what-to-listen",
      "title": "What to listen?",
      "content": "Do your best to listen to the Adhan and Surah Safat, Al Rahman and Qaf daily."
    },
    {
      "id": "remember",
      "title": "Remember this important rule all your life",
      "content": "Fear Allah with regards to his duties and he will protect you in your life. Like the prophet mentioned preserve (do your best to fulfill his obligations) Allah and he will preserve you.<br/><br/>May Allah protect you and all of us in this life and the next from every evil."
    },
    {
      "id": "resources",
      "title": "Downloadable Resources",
      "content": ""
    }
  ]
}
